{"home":{"content":"# Lecture 2: Homework\n---\n**DUE DATE:** Monday July 18th, 6:30PM.\n\n\nYour objective for this assignment is to get comfortable with styling stuff with CSS. More importantly, you'll hopefully see how certain styles can be replicated and reused in a webpage that is designed well.\n\n## Assignment\n---\nPlease complete the Wendy Bite Assignment. You will find the page materials (ie: content and images) **[here](https://github.com/mottaquikarim/FEWD629_Lecture2_WendyBite_starter)**.\n\n#### Part one\n---\nCreate a new repo on [GitHub](https://github.com/). Call it **wendybite**. (All lower case, no caps).\n\nCreate a simple HTML page like we did in class with a sentence or two and **commit** it to your GitHub using the technique we covered in class. Don't forget to add a meaningful commit message!\n\n**NOTE** When we grade this assignment, we will look for this initial commit\n\n#### Part two\n---\n\nUpdate the code you added to the HTML page you created in **Part One** and build out the actual Wendy Bite website.\n\nTry to write CSS classes that are resuable. Don't forget to use the best practices that we discussed in class when it comes to creating selectors (ie: keep specificity low).\n\nYour CSS styles should live in a seperate folder and you should link to your file in your HTML using relative URLs.\n\nFinally, make sure the nav links to both pages in your website. IE: your home page should link to the resume page and vice versa.\n\n**NOTE:** You should commit often. Try to create your page in sections to get into the habit of committing often.\n\n\n### Submission Guidelines\n---\n\n1. Once you are happy with your website, please push it to [GitBot](http://gitbot.co).\n2. Remember to give GitBot a few minutes to upload your site to its servers! **Also remember to name your homepage index.html**.\n3. **Using the slack slash command for homework**, submit the URL from gitbot via Slack. Should be something like **`/homework [URL]`**.\n4. ???\n5. Profit.\n\n\n#### [Additional Reading](http://fewd.us/marquee/?tag=week2)","idx":0},"title":{"content":"Lecture 2: Homework","idx":1},"desc":{"content":"Please complete the Wendy Bite Webpage","idx":2},"__list__":["home","title","desc"]}